<?php

$show_complete_tasks = mt_rand(0, 1);

$categories = ["Входящие", "Учеба", "Работа", "Домашние дела", "Авто"];

$tasks = [
    [
    'name' => 'Собеседование в IT Компании',
    'date' => '01.12.2018',
    'type' => 'Работа',
    'fulfilled' => 'Нет'
    ],
    [
    'name' => 'Выполнить тестовое задание',
    'date' => '25.12.2018',
    'type' => 'Работа',
    'fulfilled' => 'Нет'
    ],
    [
    'name' => 'Сделать задание первого раздела',
    'date' => '21.12.2018',
    'type' => 'Учеба',
    'fulfilled' => 'Да'
    ],
    [
    'name' => 'Встреча с другом',
    'date' => '22.12.2018',
    'type' => 'Входящие',
    'fulfilled' => 'Нет'
    ],
    [
    'name' => 'Купить корм для кота',
    'date' => 'Нет',
    'type' => 'Домашние дела',
    'fulfilled' => 'Нет'
    ],
    [
    'name' => 'Заказать пиццу',
    'date' => 'Нет',
    'type' => 'Домашние дела',
    'fulfilled' => 'Нет'
    ]
];